In [12]:
import numpy as np
import pandas as pd

In [13]:
dict1 = {
    "name":['priyanshu','rohan','sohan','skillf','yyyy','zzzz'],
    "marks":[92, 34, 44,54,55,56],
    "city":['lucknow','delhi','kanpur','bareilly','goa',"uk"]
}

In [14]:
df = pd.DataFrame(dict1)

In [15]:
df

        name  marks      city
0  priyanshu     92   lucknow
1      rohan     34     delhi
2      sohan     44    kanpur
3     skillf     54  bareilly
4       yyyy     55       goa
5       zzzz     56        uk

In [16]:
df.to_csv('friends.csv')

In [17]:
df.to_csv('friends_indexfalse.csv', index = False)

In [18]:
df.head(2)

        name  marks     city
0  priyanshu     92  lucknow
1      rohan     34    delhi

In [19]:
df.tail(3)

     name  marks      city
3  skillf     54  bareilly
4    yyyy     55       goa
5    zzzz     56        uk

In [20]:
df.describe()

           marks
count   6.000000
mean   55.833333
std    19.640944
min    34.000000
25%    46.500000
50%    54.500000
75%    55.750000
max    92.000000

In [21]:
df.describe(include='all')

             name      marks     city
count           6   6.000000        6
unique          6        NaN        6
top     priyanshu        NaN  lucknow
freq            1        NaN        1
mean          NaN  55.833333      NaN
std           NaN  19.640944      NaN
min           NaN  34.000000      NaN
25%           NaN  46.500000      NaN
50%           NaN  54.500000      NaN
75%           NaN  55.750000      NaN
max           NaN  92.000000      NaN

In [22]:
priyanshu = pd.read('priyanshu.csv')

AttributeError: module 'pandas' has no attribute 'read'

In [ ]:
priyanshu = pd.read_csv('priyanshu.csv')

In [ ]:
priyanshu

In [ ]:
priyanshu.head(3)

In [ ]:
priyanshu.tail(2)

In [ ]:
priyanshu.describe()

In [ ]:
priyanshu.describe(include='all')

In [ ]:
priyanshu['speed'][0]= 125

In [ ]:
priyanshu

In [ ]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [ ]:
priyanshu['city'][2] = "Gola Gokarnnath"

In [ ]:
priyanshu

In [ ]:
priyanshu.to_csv("priyanshu.csv",index = False)

In [ ]:
priyanshu

In [ ]:
priyanshu.index = ['first', 'second','third','fourth']

In [ ]:
priyanshu

In [ ]:
ser = pd.Series(np.random.rand(22))

In [ ]:
type(ser)

In [ ]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [ ]:
type(newdf)
newdf.head()

In [ ]:
newdf.dtypes

In [ ]:
newdf[0][0] = "priyanshu"

In [ ]:
newdf.dtypes

In [ ]:
newdf.head()

In [ ]:
newdf.index

In [ ]:
newdf.columns

In [ ]:
newdf.to_numpy()

In [ ]:
newdf[0][0] = 0.34356

In [ ]:
newdf[3][2] = 0.2244

In [ ]:
newdf.dtypes

In [ ]:
newdf

In [ ]:
newdf.T